/*
	Кузнечик
Имеется лестница, в которой N ступенек. Кузнечик находится перед лестницей. Он прыгает только вверх и способен прыгнуть вверх не более, чем на M ступенек.
Определить, сколькими способами кузнечик может допрыгать да самой верхней ступеньки.
1 ≤ M ≤ N ≤ 30
Для N = 5 и M = 2 имеется 8 маршрутов: (1,2,3,4,5)
(1,2,3,5)
(1,2,4,5)
(1,3,4,5)
(1,3,5)
(2,3,4,5)
(2,3,5)
(2,4,5)
	Input format
N M - количество ступенек в лестнице и наибольший размер прыжка кузнечика.
	Output format
R - число способов, которыми кузнечик может допрыгать до самой верхней ступеньки.
	Examples
Input	Output
5 2
	8
*/
