/*
	Расстояние редактирования
На вход подаются два слова длины не более 1000, необходимо найти расстояние редактирования между ними. Расстояние редактирования определяется следующим образом: два слова записывают одно под другим и добиваются их выравнивания путём добавления разделителя использование разделителя и несовпадение двух букв в одной позиции считается за штраф, — таким образом, расстояние редактирования — это минимальная величина штрафа.
	Пример
S - N O W Y
S U N - N Y
	Input format
первое слово второе слово
	Output format
расстояние редактирования
	Examples
Input	Output
sunny
snowy
	3
*/
