/*
	Два массива
Даны два упорядоченных по неубыванию массива. Требуется найти количество таких элементов, который имеются в обоих массивах. Например, в массивах (0, 0, 1, 1, 2, 3) и (0, 1, 1, 2) имеются общих четыре элемента - (0, 1, 1, 2).
Первая строка содержит размеры массивов N1 и N2. В следующих N1 строках содержатся элементы первого массива, в следующих за ними N2 строках - элементы второго массива.
Программа должна вывести ровно одно число — количество общих элементов.
	Формат входных данных
6 4 0 0 1 1 2 3 0 1 1 2
	Формат результата
4
*/
