/*
	Скобочки
Правильные скобочные последовательности определяются следующим образом:
1. () – правильная скобочная последовательность (ПСП).
2. Если A и B ПСП, то и AB ПСП.
3. Если A ПСП, то и (A) ПСП.
4. ПСП других видов не существует.
На вход подаётся число N. Необходимо найти последние девять цифр количества правильных скобочных последовательностей длины 2N.
Например, для N=3 такие последовательности есть ()()(), ()(()), (())(), (()()) и ((())), всего пять последовательностей.
	Input format
N (N≤100)
	Output format
Result (последние 9 цифр)
	Examples
Input	Output
3
	5
*/

#include <iostream>

using namespace std;

int main () {

	return 0;
}
