/*
	Ближайшие точки
На прямой расположено N точек с целочисленными координатами. Требуется найти пару точек, расстояние между которыми минимально.
	Input format
Первая строка входа содержит количество точек N(2 ≤ N ≤ 106). Вторая строка содержит N различных целых чисел Xi — координаты заданных точек числовой прямой. Числа в строке разделены пробелом. Значения всех координат Xii не превосходят 109 по абсолютной величине.
	Output format
В первой строке выхода необходимо вывести минимальное расстояние между двумя точками, заданными во входном файле. Во второй строке выходного файла необходимо вывести номера точек, которым соответствует найденное расстояние. Точки нумеруются натуральными числами от 1 до n в том порядке, в котором они заданы во входном файле. Если ответов несколько, выведите тот из них, в котором точки расположены левее других на числовой прямой. Первым выводится номер левой точки, далее через пробел – номер правой точки.
	Examples
Input	Output
5
	1
1 6 4 9 2
	1 5
*/
