/*
	Сеть городов
В некой стране имеется N городов, соединённых между собой дорогами, причём каждый город соединён с каждым дорогой с движением в обе стороны, которая не проходит через другие города. Дорога из города i в город j имеет стоимость Aij.
Требуется оставить только те дороги, которые
а) связывают все города, то есть, можно будет проехать из любого города в любой другой (разумеется, проезжая через другие города); б) имеют наименьшую суммарную стоимость из всех возможных вариантов.
	Input format
N
A11 A12 ... A1N
A21 A22 ... A2N
...
AN1 AN2 ... ANN
	Output format
TotalCost
	Examples
Input	Output
4
0 1 1 2
1 0 8 8
1 8 0 1
2 8 1 0
	3
*/
